Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 3C, Flags Clear Register */
#define ASCLIN13_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C0D3Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN13_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C0D40u)

/** \brief 44, Transmit Data Register */
#define ASCLIN13_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C0D44u)

/** \brief 48, Receive Data Register */
#define ASCLIN13_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C0D48u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN13_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C0D4Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN13_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C0D50u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN13_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C0DE8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN13_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C0DECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN13_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C0DF0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN13_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C0DF4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN13_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C0DF8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN13_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C0DFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin14
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN14_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C0E00u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN14_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C0E04u)

/** \brief 8, Module Identification Register */
#define ASCLIN14_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C0E08u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN14_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C0E0Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN14_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C0E10u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN14_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C0E14u)

/** \brief 18, Frame Control Register */
#define ASCLIN14_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C0E18u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN14_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C0E1Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN14_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C0E20u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN14_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C0E24u)

/** \brief 28, LIN Control Register */
#define ASCLIN14_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C0E28u)
/** Alias (User Manual Name) for ASCLIN14_LIN_CON.
* To use register names with standard convension, please use ASCLIN14_LIN_CON.
*/
#define ASCLIN14_LINCON (ASCLIN14_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN14_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C0E2Cu)
/** Alias (User Manual Name) for ASCLIN14_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN14_LIN_BTIMER.
*/
#define ASCLIN14_LINBTIMER (ASCLIN14_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN14_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C0E30u)
/** Alias (User Manual Name) for ASCLIN14_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN14_LIN_HTIMER.
*/
#define ASCLIN14_LINHTIMER (ASCLIN14_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN14_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C0E34u)

/** \brief 38, Flags Set Register */
#define ASCLIN14_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C0E38u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN14_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C0E3Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN14_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C0E40u)

/** \brief 44, Transmit Data Register */
#define ASCLIN14_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C0E44u)

/** \brief 48, Receive Data Register */
#define ASCLIN14_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C0E48u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN14_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C0E4Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN14_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C0E50u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN14_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C0EE8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN14_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C0EECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN14_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C0EF0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN14_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C0EF4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN14_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C0EF8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN14_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C0EFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin15
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN15_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C0F00u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN15_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C0F04u)

/** \brief 8, Module Identification Register */
#define ASCLIN15_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C0F08u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN15_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C0F0Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN15_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C0F10u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN15_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C0F14u)

