Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 18, Frame Control Register */
#define ASCLIN15_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C0F18u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN15_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C0F1Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN15_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C0F20u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN15_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C0F24u)

/** \brief 28, LIN Control Register */
#define ASCLIN15_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C0F28u)
/** Alias (User Manual Name) for ASCLIN15_LIN_CON.
* To use register names with standard convension, please use ASCLIN15_LIN_CON.
*/
#define ASCLIN15_LINCON (ASCLIN15_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN15_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C0F2Cu)
/** Alias (User Manual Name) for ASCLIN15_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN15_LIN_BTIMER.
*/
#define ASCLIN15_LINBTIMER (ASCLIN15_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN15_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C0F30u)
/** Alias (User Manual Name) for ASCLIN15_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN15_LIN_HTIMER.
*/
#define ASCLIN15_LINHTIMER (ASCLIN15_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN15_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C0F34u)

/** \brief 38, Flags Set Register */
#define ASCLIN15_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C0F38u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN15_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C0F3Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN15_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C0F40u)

/** \brief 44, Transmit Data Register */
#define ASCLIN15_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C0F44u)

/** \brief 48, Receive Data Register */
#define ASCLIN15_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C0F48u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN15_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C0F4Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN15_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C0F50u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN15_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C0FE8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN15_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C0FECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN15_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C0FF0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN15_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C0FF4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN15_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C0FF8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN15_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C0FFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin16
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN16_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1000u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN16_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1004u)

/** \brief 8, Module Identification Register */
#define ASCLIN16_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1008u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN16_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C100Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN16_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1010u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN16_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1014u)

/** \brief 18, Frame Control Register */
#define ASCLIN16_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1018u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN16_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C101Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN16_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1020u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN16_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1024u)

/** \brief 28, LIN Control Register */
#define ASCLIN16_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1028u)
/** Alias (User Manual Name) for ASCLIN16_LIN_CON.
* To use register names with standard convension, please use ASCLIN16_LIN_CON.
*/
#define ASCLIN16_LINCON (ASCLIN16_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN16_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C102Cu)
/** Alias (User Manual Name) for ASCLIN16_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN16_LIN_BTIMER.
*/
#define ASCLIN16_LINBTIMER (ASCLIN16_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN16_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1030u)
/** Alias (User Manual Name) for ASCLIN16_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN16_LIN_HTIMER.
*/
#define ASCLIN16_LINHTIMER (ASCLIN16_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN16_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1034u)

/** \brief 38, Flags Set Register */
#define ASCLIN16_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1038u)

