Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 3C, Flags Clear Register */
#define ASCLIN16_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C103Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN16_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1040u)

/** \brief 44, Transmit Data Register */
#define ASCLIN16_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1044u)

/** \brief 48, Receive Data Register */
#define ASCLIN16_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1048u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN16_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C104Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN16_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1050u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN16_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C10E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN16_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C10ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN16_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C10F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN16_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C10F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN16_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C10F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN16_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C10FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin17
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN17_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1100u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN17_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1104u)

/** \brief 8, Module Identification Register */
#define ASCLIN17_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1108u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN17_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C110Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN17_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1110u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN17_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1114u)

/** \brief 18, Frame Control Register */
#define ASCLIN17_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1118u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN17_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C111Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN17_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1120u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN17_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1124u)

/** \brief 28, LIN Control Register */
#define ASCLIN17_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1128u)
/** Alias (User Manual Name) for ASCLIN17_LIN_CON.
* To use register names with standard convension, please use ASCLIN17_LIN_CON.
*/
#define ASCLIN17_LINCON (ASCLIN17_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN17_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C112Cu)
/** Alias (User Manual Name) for ASCLIN17_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN17_LIN_BTIMER.
*/
#define ASCLIN17_LINBTIMER (ASCLIN17_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN17_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1130u)
/** Alias (User Manual Name) for ASCLIN17_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN17_LIN_HTIMER.
*/
#define ASCLIN17_LINHTIMER (ASCLIN17_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN17_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1134u)

/** \brief 38, Flags Set Register */
#define ASCLIN17_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1138u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN17_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C113Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN17_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1140u)

/** \brief 44, Transmit Data Register */
#define ASCLIN17_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1144u)

/** \brief 48, Receive Data Register */
#define ASCLIN17_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1148u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN17_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C114Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN17_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1150u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN17_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C11E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN17_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C11ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN17_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C11F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN17_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C11F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN17_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C11F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN17_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C11FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin18
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN18_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1200u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN18_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1204u)

/** \brief 8, Module Identification Register */
#define ASCLIN18_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1208u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN18_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C120Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN18_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1210u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN18_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1214u)

