Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 3C, Flags Clear Register */
#define ASCLIN19_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C133Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN19_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1340u)

/** \brief 44, Transmit Data Register */
#define ASCLIN19_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1344u)

/** \brief 48, Receive Data Register */
#define ASCLIN19_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1348u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN19_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C134Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN19_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1350u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN19_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C13E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN19_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C13ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN19_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C13F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN19_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C13F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN19_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C13F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN19_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C13FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin20
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN20_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1400u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN20_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1404u)

/** \brief 8, Module Identification Register */
#define ASCLIN20_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1408u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN20_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C140Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN20_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1410u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN20_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1414u)

/** \brief 18, Frame Control Register */
#define ASCLIN20_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1418u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN20_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C141Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN20_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1420u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN20_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1424u)

/** \brief 28, LIN Control Register */
#define ASCLIN20_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1428u)
/** Alias (User Manual Name) for ASCLIN20_LIN_CON.
* To use register names with standard convension, please use ASCLIN20_LIN_CON.
*/
#define ASCLIN20_LINCON (ASCLIN20_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN20_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C142Cu)
/** Alias (User Manual Name) for ASCLIN20_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN20_LIN_BTIMER.
*/
#define ASCLIN20_LINBTIMER (ASCLIN20_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN20_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1430u)
/** Alias (User Manual Name) for ASCLIN20_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN20_LIN_HTIMER.
*/
#define ASCLIN20_LINHTIMER (ASCLIN20_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN20_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1434u)

/** \brief 38, Flags Set Register */
#define ASCLIN20_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1438u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN20_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C143Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN20_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1440u)

/** \brief 44, Transmit Data Register */
#define ASCLIN20_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1444u)

/** \brief 48, Receive Data Register */
#define ASCLIN20_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1448u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN20_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C144Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN20_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1450u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN20_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C14E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN20_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C14ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN20_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C14F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN20_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C14F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN20_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C14F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN20_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C14FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin21
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN21_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1500u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN21_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1504u)

/** \brief 8, Module Identification Register */
#define ASCLIN21_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1508u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN21_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C150Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN21_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1510u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN21_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1514u)

