Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 18, Frame Control Register */
#define ASCLIN21_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1518u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN21_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C151Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN21_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1520u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN21_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1524u)

/** \brief 28, LIN Control Register */
#define ASCLIN21_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1528u)
/** Alias (User Manual Name) for ASCLIN21_LIN_CON.
* To use register names with standard convension, please use ASCLIN21_LIN_CON.
*/
#define ASCLIN21_LINCON (ASCLIN21_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN21_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C152Cu)
/** Alias (User Manual Name) for ASCLIN21_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN21_LIN_BTIMER.
*/
#define ASCLIN21_LINBTIMER (ASCLIN21_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN21_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1530u)
/** Alias (User Manual Name) for ASCLIN21_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN21_LIN_HTIMER.
*/
#define ASCLIN21_LINHTIMER (ASCLIN21_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN21_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1534u)

/** \brief 38, Flags Set Register */
#define ASCLIN21_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1538u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN21_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C153Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN21_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1540u)

/** \brief 44, Transmit Data Register */
#define ASCLIN21_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1544u)

/** \brief 48, Receive Data Register */
#define ASCLIN21_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1548u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN21_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C154Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN21_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1550u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN21_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C15E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN21_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C15ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN21_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C15F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN21_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C15F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN21_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C15F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN21_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C15FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin22
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN22_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1600u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN22_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1604u)

/** \brief 8, Module Identification Register */
#define ASCLIN22_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1608u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN22_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C160Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN22_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1610u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN22_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1614u)

/** \brief 18, Frame Control Register */
#define ASCLIN22_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1618u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN22_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C161Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN22_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1620u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN22_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1624u)

/** \brief 28, LIN Control Register */
#define ASCLIN22_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1628u)
/** Alias (User Manual Name) for ASCLIN22_LIN_CON.
* To use register names with standard convension, please use ASCLIN22_LIN_CON.
*/
#define ASCLIN22_LINCON (ASCLIN22_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN22_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C162Cu)
/** Alias (User Manual Name) for ASCLIN22_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN22_LIN_BTIMER.
*/
#define ASCLIN22_LINBTIMER (ASCLIN22_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN22_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1630u)
/** Alias (User Manual Name) for ASCLIN22_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN22_LIN_HTIMER.
*/
#define ASCLIN22_LINHTIMER (ASCLIN22_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN22_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1634u)

/** \brief 38, Flags Set Register */
#define ASCLIN22_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1638u)

