Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxAsclin_reg.h
/** \brief 3C, Flags Clear Register */
#define ASCLIN22_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C163Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN22_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1640u)

/** \brief 44, Transmit Data Register */
#define ASCLIN22_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1644u)

/** \brief 48, Receive Data Register */
#define ASCLIN22_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1648u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN22_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C164Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN22_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1650u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN22_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C16E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN22_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C16ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN22_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C16F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN22_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C16F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN22_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C16F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN22_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C16FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Asclin_Registers_Cfg_Asclin23
 * \{  */
/** \brief 0, Clock Control Register */
#define ASCLIN23_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CLC*)0xF02C1700u)

/** \brief 4, Input and Output Control Register */
#define ASCLIN23_IOCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_IOCR*)0xF02C1704u)

/** \brief 8, Module Identification Register */
#define ASCLIN23_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ID*)0xF02C1708u)

/** \brief C, TX FIFO Configuration Register */
#define ASCLIN23_TXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXFIFOCON*)0xF02C170Cu)

/** \brief 10, RX FIFO Configuration Register */
#define ASCLIN23_RXFIFOCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXFIFOCON*)0xF02C1710u)

/** \brief 14, Bit Configuration Register */
#define ASCLIN23_BITCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BITCON*)0xF02C1714u)

/** \brief 18, Frame Control Register */
#define ASCLIN23_FRAMECON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FRAMECON*)0xF02C1718u)

/** \brief 1C, Data Configuration Register */
#define ASCLIN23_DATCON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_DATCON*)0xF02C171Cu)

/** \brief 20, Baud Rate Generation Register */
#define ASCLIN23_BRG /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRG*)0xF02C1720u)

/** \brief 24, Baud Rate Detection Register */
#define ASCLIN23_BRD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_BRD*)0xF02C1724u)

/** \brief 28, LIN Control Register */
#define ASCLIN23_LIN_CON /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_CON*)0xF02C1728u)
/** Alias (User Manual Name) for ASCLIN23_LIN_CON.
* To use register names with standard convension, please use ASCLIN23_LIN_CON.
*/
#define ASCLIN23_LINCON (ASCLIN23_LIN_CON)

/** \brief 2C, LIN Break Timer Register */
#define ASCLIN23_LIN_BTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_BTIMER*)0xF02C172Cu)
/** Alias (User Manual Name) for ASCLIN23_LIN_BTIMER.
* To use register names with standard convension, please use ASCLIN23_LIN_BTIMER.
*/
#define ASCLIN23_LINBTIMER (ASCLIN23_LIN_BTIMER)

/** \brief 30, LIN Header Timer Register */
#define ASCLIN23_LIN_HTIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_LIN_HTIMER*)0xF02C1730u)
/** Alias (User Manual Name) for ASCLIN23_LIN_HTIMER.
* To use register names with standard convension, please use ASCLIN23_LIN_HTIMER.
*/
#define ASCLIN23_LINHTIMER (ASCLIN23_LIN_HTIMER)

/** \brief 34, Flags Register */
#define ASCLIN23_FLAGS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGS*)0xF02C1734u)

/** \brief 38, Flags Set Register */
#define ASCLIN23_FLAGSSET /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSSET*)0xF02C1738u)

/** \brief 3C, Flags Clear Register */
#define ASCLIN23_FLAGSCLEAR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSCLEAR*)0xF02C173Cu)

/** \brief 40, Flags Enable Register */
#define ASCLIN23_FLAGSENABLE /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_FLAGSENABLE*)0xF02C1740u)

/** \brief 44, Transmit Data Register */
#define ASCLIN23_TXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_TXDATA*)0xF02C1744u)

/** \brief 48, Receive Data Register */
#define ASCLIN23_RXDATA /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATA*)0xF02C1748u)

/** \brief 4C, Clock Selection Register */
#define ASCLIN23_CSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_CSR*)0xF02C174Cu)

/** \brief 50, Receive Data Debug Register */
#define ASCLIN23_RXDATAD /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_RXDATAD*)0xF02C1750u)

/** \brief E8, OCDS Control and Status */
#define ASCLIN23_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_OCS*)0xF02C17E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define ASCLIN23_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRSTCLR*)0xF02C17ECu)

/** \brief F0, Kernel Reset Register 1 */
#define ASCLIN23_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST1*)0xF02C17F0u)

/** \brief F4, Kernel Reset Register 0 */
#define ASCLIN23_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_KRST0*)0xF02C17F4u)

/** \brief F8, Access Enable Register 1 */
#define ASCLIN23_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN1*)0xF02C17F8u)

/** \brief FC, Access Enable Register 0 */
#define ASCLIN23_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ASCLIN_ACCEN0*)0xF02C17FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXASCLIN_REG_H */
